hpmicro/hpm_sdk/soc/HPM6700/ip/hpm_sysctl_regs.h
/*
 * HALT (RW)
 *
 * halt request for CPU0,
 * 0: CPU0 will start to execute after reset or receive wakeup request
 * 1: CPU0 will not start after reset, or wakeup after WFI
 */
#define SYSCTL_CPU_LP_HALT_MASK (0x10000UL)
#define SYSCTL_CPU_LP_HALT_SHIFT (16U)
#define SYSCTL_CPU_LP_HALT_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_HALT_SHIFT) & SYSCTL_CPU_LP_HALT_MASK)
#define SYSCTL_CPU_LP_HALT_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_HALT_MASK) >> SYSCTL_CPU_LP_HALT_SHIFT)

/*
 * WAKE (RO)
 *
 * CPU0 is waking up
 * 0: CPU0 wake up not asserted
 * 1: CPU0 wake up asserted
 */
#define SYSCTL_CPU_LP_WAKE_MASK (0x2000U)
#define SYSCTL_CPU_LP_WAKE_SHIFT (13U)
#define SYSCTL_CPU_LP_WAKE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_MASK) >> SYSCTL_CPU_LP_WAKE_SHIFT)

/*
 * EXEC (RO)
 *
 * CPU0 is executing
 * 0: CPU0 is not executing
 * 1: CPU0 is executing
 */
#define SYSCTL_CPU_LP_EXEC_MASK (0x1000U)
#define SYSCTL_CPU_LP_EXEC_SHIFT (12U)
#define SYSCTL_CPU_LP_EXEC_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_EXEC_MASK) >> SYSCTL_CPU_LP_EXEC_SHIFT)

/*
 * WAKE_FLAG (RW)
 *
 * CPU0 wakeup flag, indicate a wakeup event got active, write 1 to clear this bit
 * 0: CPU0 wakeup not happened
 * 1: CPU0 wakeup happened
 */
#define SYSCTL_CPU_LP_WAKE_FLAG_MASK (0x400U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SHIFT (10U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_WAKE_FLAG_SHIFT) & SYSCTL_CPU_LP_WAKE_FLAG_MASK)
#define SYSCTL_CPU_LP_WAKE_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_FLAG_MASK) >> SYSCTL_CPU_LP_WAKE_FLAG_SHIFT)

/*
 * SLEEP_FLAG (RW)
 *
 * CPU0 sleep flag, indicate a sleep event got active, write 1 to clear this bit
 * 0: CPU0 sleep not happened
 * 1: CPU0 sleep happened
 */
#define SYSCTL_CPU_LP_SLEEP_FLAG_MASK (0x200U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT (9U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK)
#define SYSCTL_CPU_LP_SLEEP_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK) >> SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT)

/*
 * RESET_FLAG (RW)
 *
 * CPU0 reset flag, indicate a reset event got active, write 1 to clear this bit
 * 0: CPU0 sleep not happened
 * 1: CPU0 sleep happened
 */
#define SYSCTL_CPU_LP_RESET_FLAG_MASK (0x100U)
#define SYSCTL_CPU_LP_RESET_FLAG_SHIFT (8U)
#define SYSCTL_CPU_LP_RESET_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_RESET_FLAG_SHIFT) & SYSCTL_CPU_LP_RESET_FLAG_MASK)
#define SYSCTL_CPU_LP_RESET_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_RESET_FLAG_MASK) >> SYSCTL_CPU_LP_RESET_FLAG_SHIFT)

/*
 * MODE (RW)
 *
 * Low power mode, system behavior after WFI
 * 00: CPU clock stop after WFI
 * 01: System enter low power mode after WFI
 * 10: Keep running after WFI
 * 11: reserved
 */
#define SYSCTL_CPU_LP_MODE_MASK (0x3U)
#define SYSCTL_CPU_LP_MODE_SHIFT (0U)
#define SYSCTL_CPU_LP_MODE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_MODE_SHIFT) & SYSCTL_CPU_LP_MODE_MASK)
#define SYSCTL_CPU_LP_MODE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_MODE_MASK) >> SYSCTL_CPU_LP_MODE_SHIFT)

/* Bitfield definition for register of struct array CPU: LOCK */
/*
 * GPR (RW)
 *
 * Lock bit for CPU_DATA0 to CPU_DATA13, once set, this bit will not clear untile next reset
 */
#define SYSCTL_CPU_LOCK_GPR_MASK (0xFFFCU)
#define SYSCTL_CPU_LOCK_GPR_SHIFT (2U)
#define SYSCTL_CPU_LOCK_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_GPR_SHIFT) & SYSCTL_CPU_LOCK_GPR_MASK)
#define SYSCTL_CPU_LOCK_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_GPR_MASK) >> SYSCTL_CPU_LOCK_GPR_SHIFT)

/*
 * LOCK (RW)
 *
 * Lock bit for CPU_LOCK
 */
#define SYSCTL_CPU_LOCK_LOCK_MASK (0x2U)
#define SYSCTL_CPU_LOCK_LOCK_SHIFT (1U)
#define SYSCTL_CPU_LOCK_LOCK_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_LOCK_SHIFT) & SYSCTL_CPU_LOCK_LOCK_MASK)
#define SYSCTL_CPU_LOCK_LOCK_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_LOCK_MASK) >> SYSCTL_CPU_LOCK_LOCK_SHIFT)

/* Bitfield definition for register of struct array CPU: GPR0 */
/*
 * GPR (RW)
 *
 * register for software to handle resume, can save resume address or status
 */
#define SYSCTL_CPU_GPR_GPR_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_GPR_GPR_SHIFT (0U)
#define SYSCTL_CPU_GPR_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_GPR_GPR_SHIFT) & SYSCTL_CPU_GPR_GPR_MASK)
#define SYSCTL_CPU_GPR_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_GPR_GPR_MASK) >> SYSCTL_CPU_GPR_GPR_SHIFT)

/* Bitfield definition for register of struct array CPU: STATUS0 */
/*
 * STATUS (RO)
 *
 * IRQ values
 */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK) >> SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT)

/* Bitfield definition for register of struct array CPU: ENABLE0 */
/*
 * ENABLE (RW)
 *
 * IRQ wakeup enable
 */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK) >> SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT)



/* RESOURCE register group index macro definition */
#define SYSCTL_RESOURCE_CPU0_CORE (0UL)
#define SYSCTL_RESOURCE_CPU0_SUBSYS (1UL)
#define SYSCTL_RESOURCE_CPU1_CORE (8UL)
#define SYSCTL_RESOURCE_CPX1_SUBSYS (9UL)
#define SYSCTL_RESOURCE_POW_CON (21UL)
#define SYSCTL_RESOURCE_POW_VIS (22UL)
#define SYSCTL_RESOURCE_POW_CPU0 (23UL)
#define SYSCTL_RESOURCE_POW_CPU1 (24UL)
#define SYSCTL_RESOURCE_RST_SOC (25UL)
#define SYSCTL_RESOURCE_RST_CON (26UL)
#define SYSCTL_RESOURCE_RST_VIS (27UL)
#define SYSCTL_RESOURCE_RST_CPU0 (28UL)
#define SYSCTL_RESOURCE_RST_CPU1 (29UL)
#define SYSCTL_RESOURCE_CLK_SRC_XTAL (32UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0 (33UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0CLK0 (34UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1 (35UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1CLK0 (36UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1CLK1 (37UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2 (38UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2CLK0 (39UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2CLK1 (40UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL3 (41UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL3CLK0 (42UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL4 (43UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL4CLK0 (44UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0 (64UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCHTMR0 (65UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU1 (66UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCHTMR1 (67UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXI (68UL)
#define SYSCTL_RESOURCE_CLK_TOP_CONN (69UL)
#define SYSCTL_RESOURCE_CLK_TOP_VIS (70UL)
#define SYSCTL_RESOURCE_CLK_TOP_AHB (71UL)
#define SYSCTL_RESOURCE_CLK_TOP_FEMC (72UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0 (73UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI1 (74UL)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR0 (75UL)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR1 (76UL)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR2 (77UL)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR3 (78UL)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR4 (79UL)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR5 (80UL)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR6 (81UL)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR7 (82UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART0 (83UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART1 (84UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART2 (85UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART3 (86UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART4 (87UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART5 (88UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART6 (89UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART7 (90UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART8 (91UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART9 (92UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART10 (93UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART11 (94UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART12 (95UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART13 (96UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART14 (97UL)
#define SYSCTL_RESOURCE_CLK_TOP_UART15 (98UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C0 (99UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C1 (100UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C2 (101UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C3 (102UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI0 (103UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI1 (104UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI2 (105UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI3 (106UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN0 (107UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN1 (108UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN2 (109UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN3 (110UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTPC (111UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA0 (112UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1 (113UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA2 (114UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD0 (115UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD1 (116UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD2 (117UL)
#define SYSCTL_RESOURCE_CLK_TOP_LCDC (118UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAM0 (119UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAM1 (120UL)
#define SYSCTL_RESOURCE_CLK_TOP_ENET0 (121UL)
#define SYSCTL_RESOURCE_CLK_TOP_ENET1 (122UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTP0 (123UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTP1 (124UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF0 (125UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF1 (126UL)
#define SYSCTL_RESOURCE_CLK_TOP_NTMR0 (127UL)
#define SYSCTL_RESOURCE_CLK_TOP_NTMR1 (128UL)
#define SYSCTL_RESOURCE_CLK_TOP_SDXC0 (129UL)
#define SYSCTL_RESOURCE_CLK_TOP_SDXC1 (130UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0 (192UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1 (193UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC2 (194UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC3 (195UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S0 (196UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S1 (197UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S2 (198UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S3 (199UL)
#define SYSCTL_RESOURCE_AHBAPB_BUS (256UL)
#define SYSCTL_RESOURCE_AXI_BUS (257UL)
#define SYSCTL_RESOURCE_CONN_BUS (258UL)
#define SYSCTL_RESOURCE_VIS_BUS (259UL)
#define SYSCTL_RESOURCE_FEMC (260UL)
#define SYSCTL_RESOURCE_ROM (261UL)
#define SYSCTL_RESOURCE_LMM0 (262UL)
#define SYSCTL_RESOURCE_LMM1 (263UL)
#define SYSCTL_RESOURCE_MCHTMR0 (264UL)
#define SYSCTL_RESOURCE_MCHTMR1 (265UL)
#define SYSCTL_RESOURCE_AXI_SRAM0 (266UL)
#define SYSCTL_RESOURCE_AXI_SRAM1 (267UL)
#define SYSCTL_RESOURCE_XPI0 (268UL)
#define SYSCTL_RESOURCE_XPI1 (269UL)
#define SYSCTL_RESOURCE_SDP (270UL)
#define SYSCTL_RESOURCE_RNG (271UL)
#define SYSCTL_RESOURCE_KEYM (272UL)
#define SYSCTL_RESOURCE_HDMA (273UL)
#define SYSCTL_RESOURCE_XDMA (274UL)
#define SYSCTL_RESOURCE_GPIO (275UL)
#define SYSCTL_RESOURCE_MBX0 (276UL)
#define SYSCTL_RESOURCE_MBX1 (277UL)
#define SYSCTL_RESOURCE_WDG0 (278UL)
#define SYSCTL_RESOURCE_WDG1 (279UL)
#define SYSCTL_RESOURCE_WDG2 (280UL)
#define SYSCTL_RESOURCE_WDG3 (281UL)
#define SYSCTL_RESOURCE_GPTMR0 (282UL)
#define SYSCTL_RESOURCE_GPTMR1 (283UL)
#define SYSCTL_RESOURCE_GPTMR2 (284UL)
#define SYSCTL_RESOURCE_GPTMR3 (285UL)
#define SYSCTL_RESOURCE_GPTMR4 (286UL)
#define SYSCTL_RESOURCE_GPTMR5 (287UL)
#define SYSCTL_RESOURCE_GPTMR6 (288UL)
#define SYSCTL_RESOURCE_GPTMR7 (289UL)
#define SYSCTL_RESOURCE_UART0 (290UL)
#define SYSCTL_RESOURCE_UART1 (291UL)
#define SYSCTL_RESOURCE_UART2 (292UL)
#define SYSCTL_RESOURCE_UART3 (293UL)
#define SYSCTL_RESOURCE_UART4 (294UL)
#define SYSCTL_RESOURCE_UART5 (295UL)
#define SYSCTL_RESOURCE_UART6 (296UL)
#define SYSCTL_RESOURCE_UART7 (297UL)
#define SYSCTL_RESOURCE_UART8 (298UL)
#define SYSCTL_RESOURCE_UART9 (299UL)
#define SYSCTL_RESOURCE_UART10 (300UL)
#define SYSCTL_RESOURCE_UART11 (301UL)
#define SYSCTL_RESOURCE_UART12 (302UL)
#define SYSCTL_RESOURCE_UART13 (303UL)
#define SYSCTL_RESOURCE_UART14 (304UL)
#define SYSCTL_RESOURCE_UART15 (305UL)
#define SYSCTL_RESOURCE_I2C0 (306UL)
#define SYSCTL_RESOURCE_I2C1 (307UL)
#define SYSCTL_RESOURCE_I2C2 (308UL)
#define SYSCTL_RESOURCE_I2C3 (309UL)
#define SYSCTL_RESOURCE_SPI0 (310UL)
#define SYSCTL_RESOURCE_SPI1 (311UL)
#define SYSCTL_RESOURCE_SPI2 (312UL)
#define SYSCTL_RESOURCE_SPI3 (313UL)
#define SYSCTL_RESOURCE_CAN0 (314UL)
#define SYSCTL_RESOURCE_CAN1 (315UL)
#define SYSCTL_RESOURCE_CAN2 (316UL)
#define SYSCTL_RESOURCE_CAN3 (317UL)
#define SYSCTL_RESOURCE_PTPC (318UL)
#define SYSCTL_RESOURCE_ADC0 (319UL)
#define SYSCTL_RESOURCE_ADC1 (320UL)
#define SYSCTL_RESOURCE_ADC2 (321UL)
#define SYSCTL_RESOURCE_ADC3 (322UL)
#define SYSCTL_RESOURCE_ACMP (323UL)
#define SYSCTL_RESOURCE_I2S0 (324UL)
#define SYSCTL_RESOURCE_I2S1 (325UL)
#define SYSCTL_RESOURCE_I2S2 (326UL)
#define SYSCTL_RESOURCE_I2S3 (327UL)
#define SYSCTL_RESOURCE_PDM (328UL)
#define SYSCTL_RESOURCE_DAO (329UL)
#define SYSCTL_RESOURCE_SYNT (330UL)
#define SYSCTL_RESOURCE_MOT0 (331UL)
#define SYSCTL_RESOURCE_MOT1 (332UL)
#define SYSCTL_RESOURCE_MOT2 (333UL)
#define SYSCTL_RESOURCE_MOT3 (334UL)
#define SYSCTL_RESOURCE_LCDC (335UL)
#define SYSCTL_RESOURCE_CAM0 (336UL)
#define SYSCTL_RESOURCE_CAM1 (337UL)
#define SYSCTL_RESOURCE_JPEG (338UL)
#define SYSCTL_RESOURCE_PDMA (339UL)
#define SYSCTL_RESOURCE_ENET0 (340UL)
#define SYSCTL_RESOURCE_ENET1 (341UL)
#define SYSCTL_RESOURCE_NTMR0 (342UL)
#define SYSCTL_RESOURCE_NTMR1 (343UL)
#define SYSCTL_RESOURCE_SDXC0 (344UL)
#define SYSCTL_RESOURCE_SDXC1 (345UL)
#define SYSCTL_RESOURCE_USB0 (346UL)
#define SYSCTL_RESOURCE_USB1 (347UL)
#define SYSCTL_RESOURCE_REF0 (348UL)
#define SYSCTL_RESOURCE_REF1 (349UL)

/* GROUP0 register group index macro definition */
#define SYSCTL_GROUP0_0 (0UL)
#define SYSCTL_GROUP0_1 (1UL)
#define SYSCTL_GROUP0_2 (2UL)

/* GROUP1 register group index macro definition */
#define SYSCTL_GROUP1_0 (0UL)
#define SYSCTL_GROUP1_1 (1UL)
#define SYSCTL_GROUP1_2 (2UL)

/* AFFILIATE register group index macro definition */
#define SYSCTL_AFFILIATE_CPU0 (0UL)
#define SYSCTL_AFFILIATE_CPU1 (1UL)

