hpmicro/hpm_sdk/soc/HPM6700/ip/hpm_sysctl_regs.h
/* RETENTION register group index macro definition */
#define SYSCTL_RETENTION_CPU0 (0UL)
#define SYSCTL_RETENTION_CPU1 (1UL)

/* POWER register group index macro definition */
#define SYSCTL_POWER_CPU0 (0UL)
#define SYSCTL_POWER_CPU1 (1UL)
#define SYSCTL_POWER_CON (2UL)
#define SYSCTL_POWER_VIS (3UL)

/* RESET register group index macro definition */
#define SYSCTL_RESET_SOC (0UL)
#define SYSCTL_RESET_CON (1UL)
#define SYSCTL_RESET_VIS (2UL)
#define SYSCTL_RESET_CPU0 (3UL)
#define SYSCTL_RESET_CPU1 (4UL)

/* CLOCK register group index macro definition */
#define SYSCTL_CLOCK_CLK_TOP_CPU0 (0UL)
#define SYSCTL_CLOCK_CLK_TOP_MCHTMR0 (1UL)
#define SYSCTL_CLOCK_CLK_TOP_CPU1 (2UL)
#define SYSCTL_CLOCK_CLK_TOP_MCHTMR (3UL)
#define SYSCTL_CLOCK_CLK_TOP_AXI (4UL)
#define SYSCTL_CLOCK_CLK_TOP_CONN (5UL)
#define SYSCTL_CLOCK_CLK_TOP_VIS (6UL)
#define SYSCTL_CLOCK_CLK_TOP_AHB (7UL)
#define SYSCTL_CLOCK_CLK_TOP_FEMC (8UL)
#define SYSCTL_CLOCK_CLK_TOP_XPI0 (9UL)
#define SYSCTL_CLOCK_CLK_TOP_XPI1 (10UL)
#define SYSCTL_CLOCK_CLK_TOP_GPTMR0 (11UL)
#define SYSCTL_CLOCK_CLK_TOP_GPTMR1 (12UL)
#define SYSCTL_CLOCK_CLK_TOP_GPTMR2 (13UL)
#define SYSCTL_CLOCK_CLK_TOP_GPTMR3 (14UL)
#define SYSCTL_CLOCK_CLK_TOP_GPTMR4 (15UL)
#define SYSCTL_CLOCK_CLK_TOP_GPTMR5 (16UL)
#define SYSCTL_CLOCK_CLK_TOP_GPTMR6 (17UL)
#define SYSCTL_CLOCK_CLK_TOP_GPTMR7 (18UL)
#define SYSCTL_CLOCK_CLK_TOP_UART0 (19UL)
#define SYSCTL_CLOCK_CLK_TOP_UART1 (20UL)
#define SYSCTL_CLOCK_CLK_TOP_UART2 (21UL)
#define SYSCTL_CLOCK_CLK_TOP_UART3 (22UL)
#define SYSCTL_CLOCK_CLK_TOP_UART4 (23UL)
#define SYSCTL_CLOCK_CLK_TOP_UART5 (24UL)
#define SYSCTL_CLOCK_CLK_TOP_UART6 (25UL)
#define SYSCTL_CLOCK_CLK_TOP_UART7 (26UL)
#define SYSCTL_CLOCK_CLK_TOP_UART8 (27UL)
#define SYSCTL_CLOCK_CLK_TOP_UART9 (28UL)
#define SYSCTL_CLOCK_CLK_TOP_UART10 (29UL)
#define SYSCTL_CLOCK_CLK_TOP_UART11 (30UL)
#define SYSCTL_CLOCK_CLK_TOP_UART12 (31UL)
#define SYSCTL_CLOCK_CLK_TOP_UART13 (32UL)
#define SYSCTL_CLOCK_CLK_TOP_UART14 (33UL)
#define SYSCTL_CLOCK_CLK_TOP_UART15 (34UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C0 (35UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C1 (36UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C2 (37UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C3 (38UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI0 (39UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI1 (40UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI2 (41UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI3 (42UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN0 (43UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN1 (44UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN2 (45UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN3 (46UL)
#define SYSCTL_CLOCK_CLK_TOP_PTPC (47UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA0 (48UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA1 (49UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA2 (50UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD0 (51UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD1 (52UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD2 (53UL)
#define SYSCTL_CLOCK_CLK_TOP_LCDC (54UL)
#define SYSCTL_CLOCK_CLK_TOP_CAM0 (55UL)
#define SYSCTL_CLOCK_CLK_TOP_CAM1 (56UL)
#define SYSCTL_CLOCK_CLK_TOP_ENET0 (57UL)
#define SYSCTL_CLOCK_CLK_TOP_ENET1 (58UL)
#define SYSCTL_CLOCK_CLK_TOP_PTP0 (59UL)
#define SYSCTL_CLOCK_CLK_TOP_PTP1 (60UL)
#define SYSCTL_CLOCK_CLK_TOP_REF0 (61UL)
#define SYSCTL_CLOCK_CLK_TOP_REF1 (62UL)
#define SYSCTL_CLOCK_CLK_TOP_NTMR0 (63UL)
#define SYSCTL_CLOCK_CLK_TOP_NTMR1 (64UL)
#define SYSCTL_CLOCK_CLK_TOP_SDXC0 (65UL)
#define SYSCTL_CLOCK_CLK_TOP_SDXC1 (66UL)

/* ADCCLK register group index macro definition */
#define SYSCTL_ADCCLK_CLK_TOP_ADC0 (0UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC1 (1UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC2 (2UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC3 (3UL)

/* I2SCLK register group index macro definition */
#define SYSCTL_I2SCLK_CLK_TOP_I2S0 (0UL)
#define SYSCTL_I2SCLK_CLK_TOP_I2S1 (1UL)
#define SYSCTL_I2SCLK_CLK_TOP_I2S2 (2UL)
#define SYSCTL_I2SCLK_CLK_TOP_I2S3 (3UL)

/* MONITOR register group index macro definition */
#define SYSCTL_MONITOR_SLICE0 (0UL)
#define SYSCTL_MONITOR_SLICE1 (1UL)
#define SYSCTL_MONITOR_SLICE2 (2UL)
#define SYSCTL_MONITOR_SLICE3 (3UL)

/* GPR register group index macro definition */
#define SYSCTL_CPU_GPR_GPR0 (0UL)
#define SYSCTL_CPU_GPR_GPR1 (1UL)
#define SYSCTL_CPU_GPR_GPR2 (2UL)
#define SYSCTL_CPU_GPR_GPR3 (3UL)
#define SYSCTL_CPU_GPR_GPR4 (4UL)
#define SYSCTL_CPU_GPR_GPR5 (5UL)
#define SYSCTL_CPU_GPR_GPR6 (6UL)
#define SYSCTL_CPU_GPR_GPR7 (7UL)
#define SYSCTL_CPU_GPR_GPR8 (8UL)
#define SYSCTL_CPU_GPR_GPR9 (9UL)
#define SYSCTL_CPU_GPR_GPR10 (10UL)
#define SYSCTL_CPU_GPR_GPR11 (11UL)
#define SYSCTL_CPU_GPR_GPR12 (12UL)
#define SYSCTL_CPU_GPR_GPR13 (13UL)

/* WAKEUP_STATUS register group index macro definition */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS0 (0UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS1 (1UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS2 (2UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS3 (3UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS4 (4UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS5 (5UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS6 (6UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS7 (7UL)

/* WAKEUP_ENABLE register group index macro definition */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE0 (0UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE1 (1UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE2 (2UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE3 (3UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE4 (4UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE5 (5UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE6 (6UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE7 (7UL)

/* CPU register group index macro definition */
#define SYSCTL_CPU_CPU0 (0UL)
#define SYSCTL_CPU_CPU1 (1UL)


#endif /* HPM_SYSCTL_H */
